app/Http/Controllers/BukuController.php

    public function index(Request $request)
    {
        $search = $request->input('search','');
        $limit = $request->input('limit', 10); // Default limit is 10

        $query = Buku::with('kategoris');

        $query->where(function ($q) use ($search) {
            $q->where('judul', 'like', '%' . $search . '%')
              ->orWhere('penulis', 'like', '%' . $search . '%')
              ->orWhere('penerbit', 'like', '%' . $search . '%');
        });

        $data['buku'] = $query->paginate($limit);
---
SELECT * FROM "buku" WHERE ("judul" like '%%' or "penulis" like '%%' or "penerbit" like '%%') LIMIT 10 offset 0
SELECT count(*) as aggregate FROM "buku" WHERE ("judul" like '%%' or "penulis" like '%%' or "penerbit" like '%%')
SELECT "kategori".*, "buku_kategori"."buku_id" as "pivot_buku_id", "buku_kategori"."kategori_id" as "pivot_kategori_id" FROM "kategori" inner join "buku_kategori" on "kategori"."id" = "buku_kategori"."kategori_id" WHERE "buku_kategori"."buku_id" in (6, 7, 8, 9, 10, 11, 12, 13, 14, 15)